cf_billing/InformationRegisters/энргДокументыНачислений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргДокументыНачислений</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДокументНачисления</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.энргРаспределениеПомещения</v8:Type>
						<v8:Type>cfg:DocumentRef.энргНачислениеМКД</v8:Type>
						<v8:Type>cfg:DocumentRef.энргПерерасчетМКД</v8:Type>
						<v8:Type>cfg:DocumentRef.энргНачисление</v8:Type>
						<v8:Type>cfg:DocumentRef.энргПерерасчет</v8:Type>
						<v8:Type>cfg:DocumentRef.энргРаспределениеМКД</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПометкаУдаления</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидОперацийНачисления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.энргВидыОперацийНачисления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МКД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/энргДокументыНачислений/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Заполняет документы начислений.
//
// Параметры:
//  Схема				-	СхемаЗапроса.
//  ПараметрыОтбора		-	Структура.
//  ТаблицаДляПомещения	-	Строка.
//
Функция ДокументыНачислений(Схема,ПараметрыОтбора,ТаблицаДляПомещения = "") Экспорт
	
	Если Схема = Неопределено Тогда
		Схема  						= Новый СхемаЗапроса;
		Пакет 						= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 						= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));	
	КонецЕсли; 	
	
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаДокументыНачислений());
	Пакет.ТаблицаДляПомещения 		= ТаблицаДляПомещения;
	ОператорВыбора 					= Пакет.Операторы[0];	
	Источник 						= ОператорВыбора.Источники[0].Источник;
	Параметры 						= Источник.Параметры;		
	
	Если ПараметрыОтбора.Свойство("ПараметрыВТ") Тогда
		ДоступныеПоля	 			= "Организация, ПериодНачисления, Район, ВидОперацийНачисления, МКД";
		ИмяТаблицы					= "энргДокументыНачислений";
		энргФормированиеТекстовЗапроса.УстановитьОтборТаблицы(ОператорВыбора.Отбор, ИмяТаблицы,ПараметрыОтбора.ПараметрыВТ,ДоступныеПоля);		
	КонецЕсли;
	
КонецФункции

// Устанавливает пометку удаления документа начислений.
//
// Параметры:
//  ПериодНачисления		-	Дата.
//  Организация				-	СправочникСсылка.Организации.
//  Район					-	СправочникСсылка.энргЗоныОтвественности.
//  Строение				-	СправочникСсылка.энргСтроения.
//  ВидОперацийНачисления	 - 	ПеречислениеСсылка.энргВидыОперацийНачисления
//
Процедура УстановитьПометкуУдаленияДокументаНачислений(ПериодНачисления, Организация, Район, Строение, ВидОперацийНачисления) Экспорт
	
	НаборВыполненные = СоздатьНаборЗаписей();	
	
	НаборВыполненные.Отбор.Организация.Установить(Организация);
	НаборВыполненные.Отбор.ПериодНачисления.Установить(ПериодНачисления);
	НаборВыполненные.Отбор.Район.Установить(Район);
	НаборВыполненные.Отбор.ВидОперацийНачисления.Установить(ВидОперацийНачисления);	
	Если НЕ Строение = Неопределено Тогда
		НаборВыполненные.Отбор.МКД.Установить(Строение);
	КонецЕсли;
	
	НаборВыполненные.Прочитать();
	
	Для Каждого ТекСтрока из НаборВыполненные Цикл
		ТекСтрока.ПометкаУдаления = Истина;		
	КонецЦикла;
	
	НаборВыполненные.Записать();
КонецПроцедуры

// Снимает пометку удаления документа начислений.
//
// Параметры:
//  ПериодНачисления		-	Дата.
//  Организация				-	СправочникСсылка.Организации.
//  Район					-	СправочникСсылка.энргЗоныОтвественности.
//  Строение				-	СправочникСсылка.энргСтроения.
//  ВидОперацийНачисления	-	ПеречислениеСсылка.энргВидыОперацийНачисления.
//
Процедура СнятьПометкуУдаленияДокументаНачислений(ПериодНачисления, Организация, Район, Строение, ВидОперацийНачисления) Экспорт
	
	НаборВыполненные = СоздатьНаборЗаписей();	
	
	НаборВыполненные.Отбор.Организация.Установить(Организация);
	НаборВыполненные.Отбор.ПериодНачисления.Установить(ПериодНачисления);
	НаборВыполненные.Отбор.Район.Установить(Район);
	НаборВыполненные.Отбор.ВидОперацийНачисления.Установить(ВидОперацийНачисления);	
	Если НЕ Строение = Неопределено Тогда
		НаборВыполненные.Отбор.МКД.Установить(Строение);
	КонецЕсли;
	
	НаборВыполненные.Прочитать();
	
	Для Каждого ТекСтрока из НаборВыполненные Цикл
		ТекСтрока.ПометкаУдаления = Ложь;		
	КонецЦикла;
	
	НаборВыполненные.Записать();
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Получает текст запроса документы начислений.
// 
// Возвращаемое значение:
//   Строка.
//
Функция ТекстЗапросаДокументыНачислений() Экспорт
	
	Текст = 
	"ВЫБРАТЬ
	|	энргДокументыНачислений.Организация КАК Организация,
	|	энргДокументыНачислений.ПериодНачисления КАК ПериодНачисления,
	|	энргДокументыНачислений.Район КАК Район,
	|	энргДокументыНачислений.ВидОперацийНачисления КАК ВидОперацийНачисления,
	|	энргДокументыНачислений.МКД КАК МКД,
	|	энргДокументыНачислений.ДокументНачисления КАК ДокументНачисления,
	|	энргДокументыНачислений.ПометкаУдаления КАК ПометкаУдаления
	|ИЗ
	|	РегистрСведений.энргДокументыНачислений КАК энргДокументыНачислений";
	
	Возврат Текст;
	
КонецФункции

#КонецОбласти

#КонецЕсли
